code-review/NRB_3471_3546/База_Стало/InformationRegisters/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СохраненнаяНастройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/CommonModules/УниверсальныеМеханизмы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С СОХРАНЕННЫМИ НАСТРОЙКАМИ

Процедура СохранитьНастройку(ИмяНастройки, ЗначениеНастройки, ОбщаяНастройка = Ложь) Экспорт

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ОбщаяНастройка ИЛИ ТекущийПользователь = Неопределено Тогда
		НаименованиеНастройки = "Основная";
	Иначе
		// сохраняем индивидуальные настройки
		НаименованиеНастройки = ТекущийПользователь.Имя;
	КонецЕсли;

    НаборЗаписей = РегистрыСведений.СохраненныеНастройки.СоздатьНаборЗаписей();

    //Установка отборов
    НаборЗаписей.Отбор.ИмяОбъекта.Установить(ИмяНастройки);
    НаборЗаписей.Отбор.НаименованиеНастройки.Установить(НаименованиеНастройки);

    //Добавление записи настройки в регистр
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.ИмяОбъекта = ИмяНастройки;
    НоваяЗапись.НаименованиеНастройки = НаименованиеНастройки;
    НоваяЗапись.СохраненнаяНастройка = Новый ХранилищеЗначения(ЗначениеНастройки);
    НаборЗаписей.Записать();

КонецПроцедуры // СохранитьНастройку()

Функция ВосстановитьНастройку(ИмяНастройки, ОбщаяНастройка = Ложь) Экспорт

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ОбщаяНастройка ИЛИ ТекущийПользователь = Неопределено Тогда
		НаименованиеНастройки = "Основная";
	Иначе
		// восстановить настройку для конкретного пользователя
		НаименованиеНастройки = ТекущийПользователь.Имя;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|   СохраненныеНастройки.СохраненнаяНастройка
	|ИЗ
	|   РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
	|ГДЕ
	|   СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
	|   И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяНастройки);
	Запрос.УстановитьПараметр("НаименованиеНастройки", НаименованиеНастройки);
	Результат = Запрос.Выполнить();

	// При неудаче - восстанавливаем общую настройку
	Если НаименованиеНастройки <> "Основная" И Результат.Пустой() Тогда
		НаименованиеНастройки = "Основная";
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|   СохраненныеНастройки.СохраненнаяНастройка
		|ИЗ
		|   РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|   СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
		|   И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки");
		Запрос.УстановитьПараметр("ИмяОбъекта", ИмяНастройки);
		Запрос.УстановитьПараметр("НаименованиеНастройки", НаименованиеНастройки);
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		СохраненноеЗначениеХранилище = Результат.Выгрузить()[0].СохраненнаяНастройка;
		Возврат СохраненноеЗначениеХранилище.Получить();
	КонецЕсли;

КонецФункции // ВосстановитьНастройку()
